gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_timer.h
/* TIMER_CNT */
#define TIMER_CNT_CNT16                  BITS(0,15)                             /*!< 16 bit timer counter */
#define TIMER_CNT_CNT32                  BITS(0,31)                             /*!< 32 bit(TIMER1,TIMER4) timer counter */

/* TIMER_PSC */
#define TIMER_PSC_PSC                    BITS(0,15)                             /*!< prescaler value of the counter clock */

/* TIMER_CAR */
#define TIMER_CAR_CARL16                 BITS(0,15)                             /*!< 16 bit counter auto reload value */
#define TIMER_CAR_CARL32                 BITS(0,31)                             /*!< 32 bit(TIMER1,TIMER4) counter auto reload value */

/* TIMER_CREP */
#define TIMER_CREP_CREP                  BITS(0,7)                              /*!< counter repetition value */

/* TIMER_CH0CV */
#define TIMER_CH0CV_CH0VAL16             BITS(0,15)                             /*!< 16 bit capture/compare value of channel 0 */
#define TIMER_CH0CV_CH0VAL32             BITS(0,31)                             /*!< 32 bit(TIMER1,TIMER4) capture/compare value of channel 0 */

/* TIMER_CH1CV */
#define TIMER_CH1CV_CH1VAL16             BITS(0,15)                             /*!< 16 bit capture/compare value of channel 1 */
#define TIMER_CH1CV_CH1VAL32             BITS(0,31)                             /*!< 32 bit(TIMER1,TIMER4) capture/compare value of channel 1 */

/* TIMER_CH2CV */
#define TIMER_CH2CV_CH2VAL16             BITS(0,15)                             /*!< 16 bit capture/compare value of channel 2 */
#define TIMER_CH2CV_CH2VAL32             BITS(0,31)                             /*!< 32 bit(TIMER1,TIMER4) capture/compare value of channel 2 */

/* TIMER_CH3CV */
#define TIMER_CH3CV_CH3VAL16             BITS(0,15)                             /*!< 16 bit capture/compare value of channel 3 */
#define TIMER_CH3CV_CH3VAL32             BITS(0,31)                             /*!< 32 bit(TIMER1,TIMER4) capture/compare value of channel 3 */

/* TIMER_CCHP */
#define TIMER_CCHP_DTCFG                 BITS(0,7)                              /*!< dead time configure */
#define TIMER_CCHP_PROT                  BITS(8,9)                              /*!< complementary register protect control */
#define TIMER_CCHP_IOS                   BIT(10)                                /*!< idle mode off-state configure */
#define TIMER_CCHP_ROS                   BIT(11)                                /*!< run mode off-state configure */
#define TIMER_CCHP_BRKEN                 BIT(12)                                /*!< break enable */
#define TIMER_CCHP_BRKP                  BIT(13)                                /*!< break polarity */
#define TIMER_CCHP_OAEN                  BIT(14)                                /*!< output automatic enable */
#define TIMER_CCHP_POEN                  BIT(15)                                /*!< primary output enable */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA               BITS(0,4)                              /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC               BITS(8,12)                             /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                BITS(0,15)                             /*!< DMA transfer buffer address */

/* TIMER_IRMP */
#define TIMER1_IRMP_ITI1_RMP             BITS(10,11)                            /*!< TIMER1 internal trigger input 1 remap */
#define TIMER4_IRMP_CI3_RMP              BITS(6,7)                              /*!< TIMER4 channel 3 input remap */
#define TIMER10_IRMP_CI0_RMP             BITS(0,1)                              /*!< TIMER10 channel 0 input remap */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                 BIT(0)                                 /*!< the output value selection */
#define TIMER_CFG_CHVSEL                 BIT(1)                                 /*!< write CHxVAL register selection */

/* TIMER_CH0COMV_ADD */
#define TIMER_CH0COMV_ADD_CH0COMVAL      BITS(0,15)                                 /*!< Additional compare value of channel 0 */

/* TIMER_CH1COMV_ADD */
#define TIMER_CH1COMV_ADD_CH0COMVAL      BITS(0,15)                                 /*!< Additional compare value of channel 1 */

/* TIMER_CH2COMV_ADD */
#define TIMER_CH2COMV_ADD_CH0COMVAL      BITS(0,15)                                 /*!< Additional compare value of channel 2 */

/* TIMER_CH3COMV_ADD */
#define TIMER_CH3COMV_ADD_CH0COMVAL      BITS(0,15)                                 /*!< Additional compare value of channel 3 */

/* TIMER_CTL2        */
#define TIMER_CTL2_CH0CPWMEN             BIT(28)                                    /*!< Channel 0 composite PWM mode enable */
#define TIMER_CTL2_CH1CPWMEN             BIT(29)                                    /*!< Channel 1 composite PWM mode enable */
#define TIMER_CTL2_CH2CPWMEN             BIT(30)                                    /*!< Channel 2 composite PWM mode enable */
#define TIMER_CTL2_CH3CPWMEN             BIT(31)                                    /*!< Channel 3 composite PWM mode enable */

/* constants definitions */
/* TIMER init parameter struct definitions*/
typedef struct {
    uint16_t prescaler;                         /*!< prescaler value */
    uint16_t alignedmode;                       /*!< aligned mode */
    uint16_t counterdirection;                  /*!< counter direction */
    uint16_t clockdivision;                     /*!< clock division value */
    uint32_t period;                            /*!< period value */
    uint8_t  repetitioncounter;                 /*!< the counter repetition value */
} timer_parameter_struct;

/* break parameter struct definitions*/
typedef struct {
    uint16_t runoffstate;                       /*!< run mode off-state */
    uint16_t ideloffstate;                      /*!< idle mode off-state */
    uint16_t deadtime;                          /*!< dead time */
    uint16_t breakpolarity;                     /*!< break polarity */
    uint16_t outputautostate;                   /*!< output automatic enable */
    uint16_t protectmode;                       /*!< complementary register protect control */
    uint16_t breakstate;                        /*!< break enable */
} timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct {
    uint16_t outputstate;                       /*!< channel output state */
    uint16_t outputnstate;                      /*!< channel complementary output state */
    uint16_t ocpolarity;                        /*!< channel output polarity */
    uint16_t ocnpolarity;                       /*!< channel complementary output polarity */
    uint16_t ocidlestate;                       /*!< idle state of channel output */
    uint16_t ocnidlestate;                      /*!< idle state of channel complementary output */
} timer_oc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct {
    uint16_t icpolarity;                        /*!< channel input polarity */
    uint16_t icselection;                       /*!< channel input mode selection */
    uint16_t icprescaler;                       /*!< channel input capture prescaler */
    uint16_t icfilter;                          /*!< channel input capture filter control */
} timer_ic_parameter_struct;

/* TIMER interrupt enable or disable */
#define TIMER_INT_UP                        TIMER_DMAINTEN_UPIE                     /*!< update interrupt */
#define TIMER_INT_CH0                       TIMER_DMAINTEN_CH0IE                    /*!< channel 0 interrupt */
#define TIMER_INT_CH1                       TIMER_DMAINTEN_CH1IE                    /*!< channel 1 interrupt */
#define TIMER_INT_CH2                       TIMER_DMAINTEN_CH2IE                    /*!< channel 2 interrupt */
#define TIMER_INT_CH3                       TIMER_DMAINTEN_CH3IE                    /*!< channel 3 interrupt */
#define TIMER_INT_CMT                       TIMER_DMAINTEN_CMTIE                    /*!< channel commutation interrupt flag */
#define TIMER_INT_TRG                       TIMER_DMAINTEN_TRGIE                    /*!< trigger interrupt */
#define TIMER_INT_BRK                       TIMER_DMAINTEN_BRKIE                    /*!< break interrupt */
#define TIMER_INT_CH0COMADD                 TIMER_DMAINTEN_CH0COMADDIE              /*!< Channel 0 additional compare interrupt */
#define TIMER_INT_CH1COMADD                 TIMER_DMAINTEN_CH1COMADDIE              /*!< Channel 1 additional compare interrupt */
#define TIMER_INT_CH2COMADD                 TIMER_DMAINTEN_CH2COMADDIE              /*!< Channel 2 additional compare interrupt */
#define TIMER_INT_CH3COMADD                 TIMER_DMAINTEN_CH3COMADDIE              /*!< Channel 3 additional compare interrupt */

/* TIMER flag */
#define TIMER_FLAG_UP                       TIMER_INTF_UPIF                         /*!< update flag */
#define TIMER_FLAG_CH0                      TIMER_INTF_CH0IF                        /*!< channel 0 flag */
#define TIMER_FLAG_CH1                      TIMER_INTF_CH1IF                        /*!< channel 1 flag */
#define TIMER_FLAG_CH2                      TIMER_INTF_CH2IF                        /*!< channel 2 flag */
#define TIMER_FLAG_CH3                      TIMER_INTF_CH3IF                        /*!< channel 3 flag */
#define TIMER_FLAG_CMT                      TIMER_INTF_CMTIF                        /*!< channel commutation flag */
#define TIMER_FLAG_TRG                      TIMER_INTF_TRGIF                        /*!< trigger flag */
#define TIMER_FLAG_BRK                      TIMER_INTF_BRKIF                        /*!< break flag */
#define TIMER_FLAG_CH0O                     TIMER_INTF_CH0OF                        /*!< channel 0 overcapture flag */
#define TIMER_FLAG_CH1O                     TIMER_INTF_CH1OF                        /*!< channel 1 overcapture flag */
#define TIMER_FLAG_CH2O                     TIMER_INTF_CH2OF                        /*!< channel 2 overcapture flag */
#define TIMER_FLAG_CH3O                     TIMER_INTF_CH3OF                        /*!< channel 3 overcapture flag */
#define TIMER_FLAG_CH0COMADD                TIMER_INTF_CH0COMADDIF                  /*!< Channel 0 additional compare interrupt flag */
#define TIMER_FLAG_CH1COMADD                TIMER_INTF_CH1COMADDIF                  /*!< Channel 1 additional compare interrupt flag */
#define TIMER_FLAG_CH2COMADD                TIMER_INTF_CH2COMADDIF                  /*!< Channel 2 additional compare interrupt flag */
#define TIMER_FLAG_CH3COMADD                TIMER_INTF_CH3COMADDIF                  /*!< Channel 3 additional compare interrupt flag */

/* TIMER interrupt flag */
#define TIMER_INT_FLAG_UP                   TIMER_INTF_UPIF                         /*!< update interrupt flag */
#define TIMER_INT_FLAG_CH0                  TIMER_INTF_CH0IF                        /*!< channel 0 interrupt flag */
#define TIMER_INT_FLAG_CH1                  TIMER_INTF_CH1IF                        /*!< channel 1 interrupt flag */
#define TIMER_INT_FLAG_CH2                  TIMER_INTF_CH2IF                        /*!< channel 2 interrupt flag */
#define TIMER_INT_FLAG_CH3                  TIMER_INTF_CH3IF                        /*!< channel 3 interrupt flag */
#define TIMER_INT_FLAG_CMT                  TIMER_INTF_CMTIF                        /*!< channel commutation interrupt flag */
#define TIMER_INT_FLAG_TRG                  TIMER_INTF_TRGIF                        /*!< trigger interrupt flag */
#define TIMER_INT_FLAG_BRK                  TIMER_INTF_BRKIF                        /*!< break interrupt */
#define TIMER_INT_FLAG_CH0COMADD            TIMER_INT_CH0COMADD                     /*!< Channel 0 additional compare interrupt */
#define TIMER_INT_FLAG_CH1COMADD            TIMER_INT_CH1COMADD                     /*!< Channel 1 additional compare interrupt */
#define TIMER_INT_FLAG_CH2COMADD            TIMER_INT_CH2COMADD                     /*!< Channel 2 additional compare interrupt */
#define TIMER_INT_FLAG_CH3COMADD            TIMER_INT_CH3COMADD                     /*!< Channel 3 additional compare interrupt */

